In [2]:
import pandas as pd
df=pd.read_csv("Untitled 5.csv")
df

     company     job     degree  salary six fig
0     google   sales  bachelors               0
1     google     dev  bachelors               1
2     google   sales    masters               1
3     google   sales    masters               1
4   facebook     dev  bachelors               1
5   facebook   sales    masters               0
6   facebook  mkting  bachelors               1
7   facebook     dev    masters               1
8     Amazon     dev  bachelors               1
9     Amazon   sales  bachelors               0
10    Amazon  mkting  bachelors               0
11    Amazon   sales    masters               1
12    Andela   sales    masters               1
13    Andela     dev  bachelors               1
14    Andela  mkting  bachelors               0

In [4]:
#dropping the target variable
inputs=df.drop("salary six fig",axis="columns")
target=df["salary six fig"]

In [5]:
target

0     0
1     1
2     1
3     1
4     1
5     0
6     1
7     1
8     1
9     0
10    0
11    1
12    1
13    1
14    0
Name: salary six fig, dtype: int64

In [7]:
inputs

     company     job     degree
0     google   sales  bachelors
1     google     dev  bachelors
2     google   sales    masters
3     google   sales    masters
4   facebook     dev  bachelors
5   facebook   sales    masters
6   facebook  mkting  bachelors
7   facebook     dev    masters
8     Amazon     dev  bachelors
9     Amazon   sales  bachelors
10    Amazon  mkting  bachelors
11    Amazon   sales    masters
12    Andela   sales    masters
13    Andela     dev  bachelors
14    Andela  mkting  bachelors

In [8]:
#convering string into number  using label encoder
from sklearn.preprocessing import LabelEncoder

In [9]:
#creating three object since we have three
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [10]:
#creating additional  columns in the data set
inputs['company_n']=le_company.fit_transform(inputs['company'])
inputs['job_n']=le_company.fit_transform(inputs['job'])
inputs['degree_n']=le_company.fit_transform(inputs['degree'])
inputs.head()

    company    job     degree  company_n  job_n  degree_n
0    google  sales  bachelors          3      2         0
1    google    dev  bachelors          3      0         0
2    google  sales    masters          3      2         1
3    google  sales    masters          3      2         1
4  facebook    dev  bachelors          2      0         0

In [13]:
#then you need to drop the string varaible from the dataset
input_n=inputs.drop(['company','job','degree'], axis='columns')
input_n

    company_n  job_n  degree_n
0           3      2         0
1           3      0         0
2           3      2         1
3           3      2         1
4           2      0         0
5           2      2         1
6           2      1         0
7           2      0         1
8           0      0         0
9           0      2         0
10          0      1         0
11          0      2         1
12          1      2         1
13          1      0         0
14          1      1         0

In [14]:
from sklearn import tree

In [15]:
#the model
model=tree.DecisionTreeClassifier()

In [16]:
#training the model
model.fit(input_n ,target)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [17]:
#check it score
model.score(input_n,target)

1.0

In [19]:
model.predict([[1,1,0]]) #for andera

array([0])

In [20]:
model.predict([[2,2,1]])

array([0])

In [21]:
model.predict([[2,0,1]])

array([1])